Repository: devkral/archinstall_helper
Catalog: po/*/archinstall_helper.po
Languages: de

# adjustenvironment
source: Enviroment Adjustments: We begin with some adjustments to the install environment. To change the keyboard layout, use: loadkeys <layoutcode> e.g. loadkeys de To change the locale, use: export LANG="<lang>"
de: Anpassung der Arbeitsumgebung: Zum Wechseln des Tastaturlayouts kann: loadkeys <layoutcode> benutzt werden. Zum Wechseln der Sprache: export LANG="<lang>"

# network
source: Networkconnection: Before we install archlinux, we have to establish an internet connection. If you use a network cable, everything should be perfectly fine. To test you can use "dhcpcd". For wifi it's trickier. You have to enter "wifi-menu" and select the right Access Point.
de: Internetverbindung: vorhandene Kabelverbindung: kein Schritt mehr nötig. Wer sicher gehen möchte, kann "dhcpcd" eintippen. Wlan: ein gutes mitgeliefertes Tool ist "wifi-menu". Der Dialog sollte selbsterklärend sein.

# partitioning
source: Partitioning The next important thing to do, is creating space on your disk for this installation. here a list for what you need to create space: / (root)(essential) here is the main part of your system installed, it should be around 20GB or if you don't use a /home partition at least as much space as you would give a /home partition /home (optional, but recommended): you can split your own files from the system partition, this has the advantage Resizing: if you are not a linux command-line monk please reboot and resize via the tools of your existing system to create space elsewise data loss is very likely Formating existing partitions (/, /home)the next two steps are optional
de: Partitionierung The next important thing to do, is creating space on your disk for this installation. here a list for what you need to create space: / (root)(essential) here is the main part of your system installed, it should be around 20GB or if you don't use a /home partition at least as much space as you would give a /home partition /home (optional, but recommended): you can split your own files from the system partition, this has the advantageResizing: if you aren't a linux command-line monk please reboot and resize via the tools of your existing system to create space elsewise data loss is very likely Formating existing partitions (/, /home)the next two steps are optional

# crypto
source: SKIP if not using encryption: Encryption:
de: Nur nötig wenn Verschlüsselung verwendet wird: Verschlüsselung:

# lvm
source: SKIP if not using LVM: LVM:
de: Nur nötig, wenn LVM benutzt wird lvm:

# cleanup
source: Check a last time that the installation is correct then enter the simple command: reboot and boot, hopefully successful, in your fresh installed system
de: Der Rest ist ziemlich simpel: Er besteht aus dem Befehl: reboot zum Neustarten in das frisch installierte System

# InfoEnd
source: Already at the end of the step by step guide
de: Bereits am Ende der Anleitung

# InfoBeginning
source: Already at the beginning of the step by step guide
de: Bereits am Anfang der Anleitung

# InfoRange
source: The steps ranges from 0 to
de: Die Schritte gehen von 0 bis

# ErrorRange
source: Error: step out of range
de: Fehler: gelesener Schritt außerhalb dem Gültigkeitsbereich.

# ErrorEmptyFile
source: Error: Stepfile is empty. I'll try to fix this
de: Fehler: Schrittdatei leer. Versuche es zu reparieren.

# ErrorFileOther
source: Other file-error. I'll try to fix this
de: Ein anderer Dateifehler trat auf. Versuche ihn zu beheben.

source: Error: invalid step
de: Fehler: ungültiger Schritt

# ErrorStepformat
source: Error: incorrect stepfile format
de: Fehler: ungültiges Schrittdateiformat

# ErrorEmptyText
source: Error: tried to write empty text
de: Fehler: leerer Text sollte geschrieben werden
